---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallFailures.ShorterThanMinWallFailure
source: html/1be548f5-e05e-362f-c873-30b17078fcca.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallFailures.ShorterThanMinWallFailure Property

Wall is shorter than minimum height allowed by its type.\nIt is [Length] and must be at least [Length].

## Syntax (C#)
```csharp
public static FailureDefinitionId ShorterThanMinWallFailure { get; }
```